<template>
  <!--  pc-->
  <div class="d-flex" style="margin: 20px 0" v-if="!isShow && details">
    <!--   介绍-->
    <div class="flex-1 about">
      <div class="bg-base-100 rounded-2xl">
        <article class="prose prose-lg prose-stone max-w-none p-4">
          <h3 class="italic">介绍</h3>
          <article class="prose lg:prose-xl">
            <div>本人Web前端开发工作时间两年半，目前任职在某某国企，担任前端开发的任务</div>
            <div></div>
            <div>本人Web前端开发工作时间两年半</div>
            <p>目前任职在某某国企，担任前端开发的任务</p>
          </article>
          <h3>
            经历
          </h3>
          <span>
           {{ details.experience }}
          </span>
          <h3>
            本站说明
          </h3>
          <span>
            {{ details.description_station }}
          </span>
        </article>
      </div>
    </div>
    <!--   个人-->
    <div class="music_content">
      <div class="card bg-base-100 shadow-xl rounded-2xl mb-4">
        <div class="p-4">
          <h2 class="card-title pb-4">第三方地址</h2>
          <div class="font-serif">首页点击头像展示个人二维码，欢迎交流。</div>
          <div class="d-flex gap-3 pt-3">
            <svg t="1658973050939"
                 @click="jumpPage(details.github)"
                 class="icon w-10 h-10 cursor" viewBox="0 0 1024 1024" version="1.1"
                 xmlns="http://www.w3.org/2000/svg" p-id="1493" width="200" height="200">
              <path
                  d="M511.6 76.3C264.3 76.2 64 276.4 64 523.5 64 718.9 189.3 885 363.8 946c23.5 5.9 19.9-10.8 19.9-22.2v-77.5c-135.7 15.9-141.2-73.9-150.3-88.9C215 726 171.5 718 184.5 703c30.9-15.9 62.4 4 98.9 57.9 26.4 39.1 77.9 32.5 104 26 5.7-23.5 17.9-44.5 34.7-60.8-140.6-25.2-199.2-111-199.2-213 0-49.5 16.3-95 48.3-131.7-20.4-60.5 1.9-112.3 4.9-120 58.1-5.2 118.5 41.6 123.2 45.3 33-8.9 70.7-13.6 112.9-13.6 42.4 0 80.2 4.9 113.5 13.9 11.3-8.6 67.3-48.8 121.3-43.9 2.9 7.7 24.7 58.3 5.5 118 32.4 36.8 48.9 82.7 48.9 132.3 0 102.2-59 188.1-200 212.9 23.5 23.2 38.1 55.4 38.1 91v112.5c0.8 9 0 17.9 15 17.9 177.1-59.7 304.6-227 304.6-424.1 0-247.2-200.4-447.3-447.5-447.3z"
                  p-id="1494"></path>
            </svg>
            <svg t="1658974058805"
                 @click="jumpPage(details.gitee)"
                 class="icon w-10 h-10 cursor" viewBox="0 0 1024 1024" version="1.1"
                 xmlns="http://www.w3.org/2000/svg" p-id="4936" width="200" height="200">
              <path
                  d="M512 1024C230.4 1024 0 793.6 0 512S230.4 0 512 0s512 230.4 512 512-230.4 512-512 512z m259.2-569.6H480c-12.8 0-25.6 12.8-25.6 25.6v64c0 12.8 12.8 25.6 25.6 25.6h176c12.8 0 25.6 12.8 25.6 25.6v12.8c0 41.6-35.2 76.8-76.8 76.8h-240c-12.8 0-25.6-12.8-25.6-25.6V416c0-41.6 35.2-76.8 76.8-76.8h355.2c12.8 0 25.6-12.8 25.6-25.6v-64c0-12.8-12.8-25.6-25.6-25.6H416c-105.6 0-188.8 86.4-188.8 188.8V768c0 12.8 12.8 25.6 25.6 25.6h374.4c92.8 0 169.6-76.8 169.6-169.6v-144c0-12.8-12.8-25.6-25.6-25.6z"
                  fill="#000000" p-id="4937"></path>
            </svg>
            <svg t="1658973143725" class="icon w-10 h-10 cursor" viewBox="0 0 1024 1024" version="1.1"
                 xmlns="http://www.w3.org/2000/svg" p-id="1889" width="200" height="200">
              <path
                  d="M512 0C228.430769 0 0 228.430769 0 512s228.430769 512 512 512 512-228.430769 512-512S795.569231 0 512 0z m248.123077 366.276923c-3.938462 3.938462-3.938462 7.876923-7.876923 7.876923-7.876923 7.876923-15.753846 11.815385-23.630769 15.753846-3.938462 0-3.938462 3.938462-3.938462 7.876923 3.938462 43.323077-3.938462 86.646154-19.692308 129.969231-27.569231 74.830769-86.646154 133.907692-157.538461 169.353846-59.076923 35.446154-129.969231 47.261538-192.984616 31.507693-31.507692-3.938462-59.076923-15.753846-82.707692-31.507693l-3.938461-3.938461c0-3.938462 3.938462-7.876923 7.876923-7.876923 19.692308 0 39.384615-3.938462 59.076923-11.815385 19.692308-7.876923 39.384615-19.692308 55.138461-31.507692l3.938462-3.938462c0-3.938462 0-7.876923-3.938462-7.876923-15.753846-3.938462-27.569231-11.815385-39.384615-19.692308-15.753846-7.876923-27.569231-23.630769-35.446154-39.384615v-3.938461c0-3.938462 3.938462-7.876923 7.876923-7.876924h11.815385c3.938462 0 3.938462 0 3.938461-3.938461 3.938462-3.938462 0-7.876923-3.938461-11.815385-15.753846-7.876923-27.569231-19.692308-39.384616-31.507692-15.753846-15.753846-23.630769-35.446154-23.630769-55.138462v-3.938461c0-3.938462 7.876923-3.938462 7.876923-3.938462 3.938462 0 7.876923 3.938462 11.815385 3.938462h7.876923c3.938462 0 3.938462 0 7.876923-3.938462s3.938462-7.876923 0-11.815384c-15.753846-15.753846-27.569231-35.446154-31.507692-59.076923-3.938462-19.692308 0-43.323077 7.876923-63.015385v-3.938461c-7.876923 3.938462-3.938462 3.938462 0 7.876923 27.569231 27.569231 55.138462 51.2 90.584615 70.892307 39.384615 19.692308 82.707692 31.507692 126.030769 31.507693 3.938462 0 7.876923-3.938462 7.876923-7.876923 0-23.630769 7.876923-102.4 78.769231-122.092308 35.446154-11.815385 78.769231-3.938462 106.338462 27.569231 0 0 3.938462 3.938462 7.876923 3.938461 7.876923 0 15.753846-3.938462 27.569231-3.938461 7.876923-3.938462 15.753846-3.938462 23.630769-7.876923h7.876923c3.938462 0 3.938462 7.876923 3.938461 11.815384-3.938462 7.876923-11.815385 15.753846-19.692307 23.630769l-3.938462 3.938462c-3.938462 0-3.938462 3.938462-3.938461 7.876923s3.938462 7.876923 7.876923 7.876923 7.876923 0 15.753846-3.938461h7.876923c-3.938462-3.938462-3.938462 3.938462-7.876923 3.938461z"
                  fill="#080405" p-id="1890"></path>
            </svg>
          </div>
        </div>
      </div>
      <div class="card bg-base-100 shadow-xl rounded-2xl mb-4">
        <div class="p-4">
          <h2 class="card-title pb-4">我的喜欢</h2>
          <Music></Music>
        </div>
      </div>
      <div class="card bg-base-100 shadow-xl rounded-2xl mb-4">
        <div class="p-4">
          <h2 class="card-title pb-4">我的爱好</h2>
          <div class="font-semibold p-1">运动：篮球，羽毛球</div>
          <div class="font-semibold p-1">游戏：JJ斗地主</div>
          <div class="font-semibold p-1">观影：水浒传</div>
        </div>
      </div>
    </div>
  </div>
  <!--移动端-->
  <div v-else class="d-flex flex-d mobile-about">
    <!--   介绍-->
    <div class="flex-1">
      <div class="bg-base-100 rounded-2xl">
        <article class="prose prose-lg prose-stone max-w-none p-4">
          <h3 class="italic">介绍</h3>
          <span>
        人生就是由欲望不满足而痛苦和满足之后无趣这两者所构成。你满心期待着未来的某个快乐，未必理智认知到了它是短暂的而不会持久。人的一生的本质是痛苦，快乐只是昙花一现。
      </span>
          <h3>
            经历
          </h3>
          <span>
        人生就是由欲望不满足而痛苦和满足之后无趣这两者所构成。你满心期待着未来的某个快乐，未必理智认知到了它是短暂的而不会持久。人的一生的本质是痛苦，快乐只是昙花一现。
      </span>
          <span>
        人生就是由欲望不满足而痛苦和满足之后无趣这两者所构成。你满心期待着未来的某个快乐，未必理智认知到了它是短暂的而不会持久。人的一生的本质是痛苦，快乐只是昙花一现。
      </span>
          <h3>
            本站说明
          </h3>
          <span>
        人生就是由欲望不满足而痛苦和满足之后无趣这两者所构成。你满心期待着未来的某个快乐，未必理智认知到了它是短暂的而不会持久。人的一生的本质是痛苦，快乐只是昙花一现。
      </span>
          <span>
        人生就是由欲望不满足而痛苦和满足之后无趣这两者所构成。你满心期待着未来的某个快乐，未必理智认知到了它是短暂的而不会持久。人的一生的本质是痛苦，快乐只是昙花一现。
      </span>
          <h3>
            本站说明
          </h3>
          <span>
        人生就是由欲望不满足而痛苦和满足之后无趣这两者所构成。你满心期待着未来的某个快乐，未必理智认知到了它是短暂的而不会持久。人的一生的本质是痛苦，快乐只是昙花一现。
      </span>
          <span>
        人生就是由欲望不满足而痛苦和满足之后无趣这两者所构成。你满心期待着未来的某个快乐，未必理智认知到了它是短暂的而不会持久。人的一生的本质是痛苦，快乐只是昙花一现。
      </span>
        </article>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
import Music from '@/components/Music/index.vue';
import isShow from "../utils/judgeTheClient";
import {about} from '../api/index';

const details: any = ref()

const jumpPage = (url: string) => {
  window.open(url)
}

const introduction = async () => {
  let {data} = await about()
  details.value = data.data[0]
  console.log(details.value, 111)
}

introduction()
</script>

<style lang="scss">
.about {
  margin-right: 50px;
}

.music_content {
  width: 360px;
}

.mobile-about {
  margin: 20px;
}
</style>
